f = open("WAR_CRIME_ISKUSTVO.py", "w", encoding='utf-8')
a = list("""Искусство войны. Сунь цзы
1. Начальные расчеты
Суньцзы сказал
Война - это великое дело государства, основа жизни и смерти, Путь к выживанию или
гибели. Это нужно тщательно взвесить и обдумать.
Поэтому определяй ее в [соответствии] со следующими пятью явлениями, измеряй ее
расчетами и ищи ее подлинную природу. Первый называется Дао, второй - Небо, третий -
Земля, четвертый - Полководец и пятый - Закон [военной организации и дисциплины].
Дао заставляет людей быть в полной гармонии с правителем. [Поэтому], они будут
умирать вместе с ним, они будут жить вместе с ним и не бояться опасности.
Небо заключает в себе инь и ян, холод и жару и порядок сезонов.
Земля заключает в себе далекое или близкое, трудное или легкое, обширное или сжатое,
смертельную или надежную местность.
Полководец заключает в себе мудрость, доверие, гуманность, мужество и строгость.
Закон [военной организации и дисциплины] заключает в себе организацию и
предписания, Дао командования и снабжения.
Нет таких полководцев, которые не слышали бы об этих пяти. Те, кто понимает их,
будут побеждать; те, кто не понимает их, не будут побеждать.
Поэтому, измеряя с помощью расчетов, ища подлинную природу, спроси
Кто из правителей обладает Дао
Кто из полководцев обладает наибольшими способностями
Кто обрел [преимущества] Неба и Земли
Чьи законы и приказы выполняются более тщательно
Чьи войска сильнее
Чьи командиры и воины лучше обучены
Чьи награды и наказания понятнее
Из этого я узнаю победу и поражение!
Если полководец следует моим расчетам и ты используешь его, он обязательно одержит
победу, и его следует удержать. Если полководец не следует моим расчетам и ты
используешь его, он обязательно будет разбит, поэтому, убери его.
Усвоив эти расчеты, сложи их со стратегической мощью [ши], дополненной боевой
тактикой, отвечающей внешним обстоятельствам. Что касается стратегической силы, [она]
использует боевую тактику [цюань] в соответствии с выгодой, которая должна быть.
Война - это путь обмана. Поэтому, даже если [ты] способен, показывай противнику свою
неспособность. Когда должен ввести в бой свои силы, притворись бездеятельным. Когда
[цель] близко, показывай, будто она далеко; когда же она действительн далеко, создавай
впечатление, что она близко.
Изобрази выгоду, чтобы завлечь его. Сотвори беспорядок [в его силах] и возьми его.
Если он полон, приготовься; если он силен, избегай его.
Если он в гневе, беспокой его; будь почтителен, чтобы он возомнил о себе.
Если враг отдохнувший, заставь его напрячь силы.
Если он объединен, разъедини его.
Нападай там, где он не приготовился.
Или вперед там, где он не ожидает.
Таковы пути, которыми военные стратеги побеждают. Но о них нельзя говорить
наперед.
Тот, кто еще до сражения определяет в храме предков, что одержит победу, находит, что
большинство обстоятельств в его пользу. Тот, кто еще до сражения определяет в храме
предков, что не одержит победу, находит немного обстоятельств в свою пользу.
Если тот, кто нашел, что большинство обстоятельств говорят в его пользу, победит, а
тот, кто нашел, что немного обстоятельств говорят в его пользу, будет разбит, то что говорить
о том, кто не находит никаких обстоятельств в свою пользу
Если я посмотрю на это так, победа и поражение будут очевидны.
         
2.Ведение войны
Суньцзы сказал:
"Стратегия использования сил такова: если есть тысяча колесниц нападения, каждая
запряженная четырьмя лошадьми, одна тысяча колесниц поддержки, покрытых кожаными
доспехами, сто тысяч воинов в кольчугах, а провизия доставляется на тысячу ли, то тогда
расходы внутренние и внешние на прием советников и гостей, на материалы, такие как клей и
лак, а также на обеспечение колесницами и доспехами составят тысячу золотых в день.
Только тогда можно собрать войско в сто тысяч.
Если используешь их в битве, но победа долго не приходит, их оружие притупляется, а
рвение - ослабевает. Если осаждаешь города, их силы истощаются. Если подвергаешь войско
длительной войне, запасов государства не хватит.
Когда оружие притупилось, а дух - угнетен, когда наши силы истощены, а запасы -
израсходованы, тогда удельные князья воспользуются нашей слабостью и поднимутся. Даже
если у тебя есть мудрые полководцы, они не смогут ничего достичь.
Поэтому я слышал об успехе быстрых военных походов, и не слышал об успехе
затяжных. Ни одно государство не извлекло выгоды из длительной войны.
Те, кто недостаточно понимают опасности войны, не могут понять и выгоду от войны.
Тот, кто преуспел в использовании армии, не набирает людей дважды и не перевозит
провиант трижды. Если получаешь снаряжение из своего государства и опираешься на захват
провианта у врага, то запасов будет достаточно.
Государство истощается войной, если провиант доставляется далеко. Когда провиант
доставляется далеко, народ разорен.
Те, кто близки к армии, будут продавать дорого свои товары. Когда товары дороги,
средства народа иссякнут. Когда средства иссякли, чрезвычайно трудно заставить их
выполнять военные повинности.
Когда их силы истощены, а средства иссякли, дома на центральных равнинах опустеют.
Расходы народа будут составлять семь десятых от того, чем он обладает. Расходы правителя -
сломанные колесницы, павшие лошади, доспехи, шлемы, стрелы и арбалеты, [большие
подвижные] щиты с алебардами и копьями, деревенский скот и большие повозки - составят
шесть десятых его богатств.
Поэтому мудрый полководец должен отнимать провиант у врага. Один бушель зерна
противника стоит двадцати наших; одна единица фуража стоит двадцати наших.
Так, то, что [побуждает людей] уничтожать врага - это ярость, что [побуждает их]
наживаться - это богатства. Если при сражении на колесницах захватили десять или более
колесниц, вознагради того, кто сделал это первым. Смени знамена врага на наши, смешай его
колесницы со своими и задействуй их вместе. Хорошо обращайся с пленниками, дабы их
[можно было] использовать. Это называется "победить врага и стать сильнее".
Так, армия любит побеждать и не любит затяжной войны. Поэтому, полководец,
понимающий войну, является хозяином судеб людей, хранителем безопасности государства."
         
3.Планирование нападения
Суньцзы сказал:
"Метод использования войск следующий: наилучшее - сохранить столицу государства
[врага], на втором месте - разрушить его столицу. Наилучшее - сохранить его армию, на
втором месте - разбить ее.
Наилучшее - сохранить соединения врага, на втором месте - уничтожить их. Наилучшее
- сохранить подразделения врага, на втором месте - уничтожить их.
Наилучшее - сохранить "пятерки" врага, на втором месте - уничтожить их. Поэтому
одержать сто побед в ста сражениях - это не вершина превосходства. Подчинить армию врага
не сражаясь - вот подлинная вершина превосходства.
Поэтому высшее пресуществление войны - разрушить планы врага; затем - разрушить
его союзы; затем - напасть на его армию; и самое последнее - напасть на его укрепленные
города.
Осада города применяется только тогда, когда это неизбежно. Подготовка больших
подвижных оборонительных щитов, укрепленных осадных повозок и других приспособлений
и устройств потребует три месяца. Постройка земляных укреплений до полного завершения
потребует еще три месяца. Если полководец не может преодолеть нетерпения и бросит солдат
ползти по стенам, как муравьев, он погубит треть своих командиров и солдат, а город не
будет взят. В этом гибельные последствия осады города.
Поэтому тот, кто преуспел в военном деле, подчиняет чужие армии, не вступая в битву,
захватывает чужие города, не осаждая их, и разрушает чудие государства без
продолжительного сражения. Он должен сражаться под Небом с высшей целью "сохранения".
Тогда его оружие не притупится и плоды победы можно будет удержать. В этом стратегия
наступления.
Стратегия ведения войны такова: если сил в десять раз больше, чем у врага, окружи его;
если в пять раз больше, атакуй его; если в два раза больше, раздели свои силы. Если силы
равны, можешь с ним сразиться. Если сил меньше, перехитри его. Если тебя превосходят,
избегай его. Поэтому упорствующий с малым, станет пленником большого.
Полководец - это поддерживающая опора государства. Если его знания крепки,
государство обязательно будет сильным. Если в опоре появятся трещины, государство
неизбежно ослабеет.
Поэтому, есть три случая, когда армия ставится в трудное положение своим правителем:
Он не знает, что три армии не должны продвигаться, но требует, чтобы они наступали,
или не знает, что три армии не должны отходить, и приказывает отступать. Это называется
"запутыванием армии".
Он не понимает военных дел трех армий, но [указывает им] по аналогии с
[гражданским] управлением. Тогда командиры будут растеряны.
Он не понимает тактического равновесия сил в трех армиях, но берет на себя
ответственность за командование. Тогда командиры будут в сомнении.
Когда три армии в растерянности и сомнении, возникает опасность, что удельные князья
[воспользуются ситуацией]. Это называется "разрушенная армия приближает к победе
другого".
Вот пять признаков, из которых можно узнать о победе:
Тот, кто знает, когда можно сражаться, а когда нельзя, одержит победу.
Тот, кто понимает, как использовать большие и малые силы, одержит победу.
Тот, у кого верхи и низы горят одним и тем же желанием, одержит победу.
Тот, кто будучи полностью готов, ждет неподготовленного, одержит победу.
Тот, у кого полководец способный, а правитель не мешает ему, одержит победу.
Таковы пять путей узнать победу.
Поэтому сказано, что тот, кто знает врага и знает себя, не окажется в опасности и в ста
сражениях. Тот, кто не знает врага, но знает себя, будет то побеждать, то проигрывать. Тот,
кто не знает ни врага, ни себя, неизбежно будет разбит в каждом сражении."

4.Боевая форма
Суньцзы сказал:
"В древности те, кто преуспел в войне, прежде всего делали непобедимыми себя, чтобы
ждать [момента, когда] можно покорить врага.
Непобедимость заключена в самом себе; возможность победы зависит от врага.
Поэтому тот, кто преуспел в войне, может сделать непобедимым себя, но не обязательно
может заставить врага покориться.
Поэтому сказано, что стратегию победы над врагом можно познать, но не всегда можно
применить.
Тот, кто не может победить, занимает оборонительную позицию; кто может победить -
атакует. При этих обстоятельствах, если занимать оборону, то сил будет более, чем
достаточно, в то время, как при нападении их будет недоставать.
Тот, кто умеет обороняться, зарывается в самые глубины Земли. Тот, кто умеет
нападать, обрушивается с самых высот Неба. Так они могут сохранить себя и достичь полной
победы.
Предвидение победы, которое не превосходит того, что могут видеть немногие, не есть
вершина превосходства. Добиться победы, после которой в Поднебесной похвалят тебя, не
есть вершина превосходства.
Так, умение поднять осенний лист не может считаться большой силой; способность
видеть луну и солнце не может считаться острым зрением; способность слышать звук грома
не может считаться тонким слухом.
Те, кого древние считали преуспевшими в войне, покоряли тех, кого можно было
покорить. Поэтому победы преуспевших в войне не требовали мудрости или мужества.
Поэтому их победы были свободны от ошибок. Тот, кто свободен от ошибок, отправляется
побеждать тех, кто уже побежден.
Поэтому тот, кто преуспел в войне, первым делом выбирает позицию, где он не может
быть разбит, вместе с тем не упуская [любой возможности] разбить врага.
Поэтому, победоносная армия сначала осознает условия победы, а затем ищет битвы;
проигравшая армия сначала сражается, а затем ищет победу.
Тот, кто преуспел в использовании войск, культивирует Дао и сохраняет законы;
поэтому он может управлять победой и поражением.
Что касается военных методов: первый называется измерением; второй - оценкой [сил];
третий - расчетом [количества людей]; четвертый - взвешиванием [относительных сил];
пятый - победой.
Местность порождает измерение; измерение производит оценку [сил]. Оценка [сил]
порождает расчет [количеств людей]. Расчет [количества людей] порождает взвешивание
[сил]. Взвешивание [сил] порождает победу.
Поэтому победоносная армия подобна тонне в сравнении с унцией, а побежденная
армия подобна унции в сравнении с тонной. Битва победоносной армии подобна внезапному
освобождению стесненного потока, низвергающегося в пропасть с высоты тысячи саженей. В
этом состоит стратегическая форма сил."
         
5.Пустота и полнота
Суньцзы сказал:
"Тому, кто первым приходит на поле сражения и ожидает врага, будет легко; тот, кто
приходит после и должен спешить в бой, будет утомлен. Поэтому тот, кто преуспел в войне,
подчиняет других и не дает подчинить себя.
Для того, чтобы заставить врага выступить против его воли, завлекай его какой-либо
[ясной] выгодой. Для того, чтобы предотвратить выступление врага, покажи ему [возможный]
вред этого.
Поэтому, если противник свежий, можешь утомить его; если он сыт, можешь заставить
его голодать; если он отдыхает, можешь беспокоить его. Выйди вперед на позиции, к
которым он должен спешить. Поспеши вперед туда, где он не ожидает этого.
Чтобы пройти тысячу ли и не устать, пересекай незанятые территории. Чтобы
обеспечить достижение цели при атаке, наноси удар по незащищенным позициям. Чтобы
быть уверенным в прочности обороны, укрепляй позиции, которые противник не может
атаковать.
Поэтому, когда кто-то умеет нападать, враг не знает, где организовать оборону; когда
кто-то умеет обороняться, враг не знает, где атаковать. Непостижимо! Непостижимо! Оно
приближается к бесформенному. Возвышенное! Возвышенное! Оно беззвучно. Поэтому он
может быть властителем судьбы врага.
Чтобы осуществить наступление, которому невозможно воспрепятствовать, нанеси удар
по незащищенным позициям. Чтобы осуществить отступление, которое нельзя догнать, иди с
непревосходимой скоростью. Поэтому, если я хочу вступить в битву, даже если у противника
высокие валы и глубокие рвы, он не сможет избежать боя, ибо я нападаю на цели, которые он
должен спасать.
Если я не хочу вступать в битву, то даже если я просто прочерчу линию по земле и стану
защищать ее, враг не сможет втянуть меня в бой, ибо мы чужие его движению.
Поэтому, если я определяю форму сил [ши] противника, в то время как мои войска
неразличимы, я могу собрать [силы], когда силы врага разделены. Если мы собраны в единую
силу, а противник разделен на десять частей, то мы нападем на него с превосходящей в десять
раз мощью. Тогда нас будет много, а врагов - мало. Если мы сможем напасть такими
большими силами на малое количество врага, те, кто вступят в битву, будут сжаты со всех
сторон.
Место, где мы будем сражаться с врагом, не должно быть известным ему. Если он не
знает о нем, он будет вынужден подготовить множество узлов обороны. Если узлов обороны,
подготовленных врагом, будет много, тогда сил, с которыми он вступит в бой, будет мало.
Тогда, если он изготовится спереди, сзади будет мало воинов. Если они защищают тыл, то
впереди будет мало сил. Если он готовится обороняться слева, то справа будет мало воинов.
Если он готовится обороняться справа, то тогда слева будет мало воинов. Если у него не
будет незащищенных позиций, то тогда в любом месте воинов будет немного. Немногие
готовятся против других; многие заставляют других готовиться против них.
Поэтому, если знать место и день сражения, можно пройти тысячу ли и собрать воедино
силы для боя. Если не знать ни места, ни дня сражения, тогда ни левый не придет на помощь
правому, ни правый не поможет левому; передние не смогут помочь задним, а задние -
передним. Тем более, когда дальние находятся на расстоянии в десятки ли, а ближние отстоят
на несколько ли. Как я понимаю это, даже если армия Юэ многочисленна, как этим можно
достичь победы? Поэтому я утверждаю, что победа возможна. Даже если враг превосходит
нас числом, ему можно не дать сразиться.
Поэтому, оценивают противника, чтобы рассчитать успех и потери. Подталкивают его,
чтобы знать его передвижения и остановки. Определяют его расположение [сил], чтобы знать
смертельные и надежные территории. Испытывают его, чтобы знать, где у него избыток, а где
- недостаток. Поэтому, военное развертывание в наивысшей точке приближается к
бесформенному. Если оно бесформенно, то даже самый тайный шпион не сможет распознать
его, мудрый не сможет составить план против него.
В соответствии с формой врага, мы устанавливаем победные цели для войска, но оно не
в состоянии постичь их. Все воины знают форму [сил], благодаря которой мы добиваемся
победы, но никто не знает той формы [сил], с помощью которой мы управляем победой.
Поэтому победоносная боевая [стратегия] не повторяется, формы ответа врагу -
неисчислимы.
Форма сил армии подобна воде. Форма воды - избежать высот и стремиться вниз. Форма
сил армии - избегать полноты и наносить удар по пустоте. Вода оформляет поток в
соответствии с местностью, армия идет к победе в соответствии с врагом. Поэтому у армии
нет какого-нибудь постоянного стратегического расположения сил; у воды нет постоянной
формы.
Тот, кто способен изменяться и преобразовываться в соответствии с врагом и вырывать
победу, зовется возвышенным! Поэтому [ни один из] пяти циклов не господствует постоянно;
четыре времени года не сохраняют постоянно свое место; солнце светит более
продолжительное и более короткое время; луна убывает и прибывает."
        
6.Боевое сражение
Суньцзы сказал:
"Стратегия использования армии такова: [с того времени, как] полководец получает
приказ от правителя, объединяет армии и собирает войска вплоть до столкновения с врагом и
разбивки лагеря, нет ничего более трудного, чем боевое сражение. В боевом сражении самое
трудное - это превратить обходной путь в прямой, превратить неблагоприятную обстановку в
преимущество.
Поэтому, если заставить врага пойти кружным путем и заманить его выгодой, даже если
выступил после него, прибудешь раньше него. Это - понимание тактики окружного и
прямого.
Поэтому, сражение между армиями может быть выгодным, сражение между армиями
может быть опасным. Если вся армия борется за преимущество, не прибудешь вовремя. Если
урезать армию ради преимущества, обоз и снаряжение сильно пострадают.
Поэтому, если сбросишь доспехи, чтобы идти вперед днем и ночью, не останавливаясь
на отдых, проходя за день вдвое больше обычного, и пройдешь сто ли, чтобы бороться за
выгоду, полководцы трех армий будут захвачены в плен. Первыми придут сильные, а
истощенные - последними. С такой тактикой только один из десяти достигнет [поля боя].
Когда за выгоду борются за пятьдесят ли, командующий верхней армией будет в трудном
положении. С такой тактикой половина людей дойдет [до цели]. Если борются за выгоду за
тридцать ли, то две трети армии дойдут [до цели].
Поэтому, если у армии нет обоза и снаряжения, она погибнет; если нет провианта, она
погибнет; если нет запасов, она погибнет.
Так, тот, кто не знает замыслов удельных князей, не может наперед заключать союзы.
Тот, кто не знаком с горами и лесами, ущельями и впадинами, формой болот и низин, не
может вести войско. Тот, у кого нет местных проводников, не может использовать
преимущества местности.
Поэтому, армия устанавливается обманом, продвигается ради преимущества, и
изменяется через разделение и соединение. Поэтому ее скорость подобна ветру, ее
медлительность подобна лесной чаще; ее вторжение и грабеж подобны огню; ее
неподвижность подобна горам. Ее трудно познать, как и темноту; в движении она подобна
грому.
Когда грабишь какую-либо местность, раздели добычу с войсками. Когда расширяешь
свою территорию, раздели выгоду. Держи под контролем стратегическое равновесие сил и
продвигайся. Тот, кто первым поймет тактику обходного и прямого, одержит победу. Такова
стратегия боевого сражения.
В "Управлении армией" сказано: "Так как они не могли слышать друг друга, придумали
гонги и барабаны; так как не могли видеть друг друга, придумали знамена и флаги." Гонги и
барабаны, знамена и флаги - это средство слить воедино глаза и уши людей. Когда люди
объединены, мужественные не смогут наступать в одиночестве, пугливые не смогут
отступать одни. Вот правило управления большими силами.
Поэтому в ночных битвах сделай гонги и барабаны многочисленными, а при дневных
битвах сделай многочисленными знамена и флаги, чтобы изменить глаза и уши людей.
Ци трех армий можно вырвать с корнем, разум полководца можно отнять. Поэтому
утром ци врага - пылающая; в течении дня ци становится вялой; к сумеркам ци истощается.
Тот, кто умело использует армию, избегает пылающей ци противника и наносит удар, когда
ци вялая или истощена. В этом путь управления ци.
Пребывая в порядке, ожидай беспорядка; в спокойствии ожидай шумного. В этом путь
управления разумом.
С теми, кто рядом, ожидай далекого; с отдохнувшими ожидай усталого; с сытыми
ожидай голодного. В этом путь управления силой.
Не препятствуй флагам, когда они в порядке; не нападай на хорошо организованное
войско. В этом путь управления изменениями.
Стратегия ведения войны такова: не приближайся к высоким горам; не сталкивайся с
теми, позади которых холмы. Не преследуй мнимо отступающих. Не нападай на
воодушевленные войска. Не заставляй армию быть приманкой. Не препятствуй армии,
идущей домой. Если окружаешь армию, должен оставаться выход. Не дави на изнуренного
врага. Такова стратегия ведения войны."
         
7.Девять изменений
Суньцзы сказал:
"В целом, стратегия ведения войны такова. После того, как полководец получил приказы
от правителя, объединил армию и собрал войска:
Не разбивай лагерь на обманчивой местности.
Объединяйся с союзниками на удобной местности.
Составь стратегические планы для окруженной местности.
Сражайся на смертельной местности.
Есть дороги, по которым не ходят.
Есть армии, на которые не нападают.
Есть укрепленные города, которые не штурмуют.
Есть местности, из-за которых не соперничают.
Есть приказы правителя, которые не выполняют.
Поэтому полководец, обладающий пониманием преимуществ девяти изменений, знает
как использовать армию. Если полководец не обладает пониманием преимуществ девяти
изменений, то даже будучи знакомым с местностью, он не сможет использовать
преимуществ.
Тот, кто командует армией, но не знает способов девяти изменений, даже если он знаком
с пятью преимуществами, не сможет управлять людьми.
Поэтому мудрые с пониманием связывают выгоды и потери. Если они оценивают
выгоду [в трудном положении], усилия могут быть оправданы. Если оценивают вред [в
возможной выгоде], трудности могут быть разрешены.
Поэтому, подчиняй удельных князей угрозой вреда; займи их многочисленными делами;
и пусть удельные князья спешат за выгодой.
Стратегия ведения войны такова: не полагайся на то, что враг не придет, полагайся на
средства, которыми располагаешь, чтобы принять его. Не полагайся на то, что враг не
нападет; полагайся на то, чтобы наши позиции были неуязвимы для нападения.
У полководца пять опасностей [черт характера]:
Стремящийся умереть может быть убит.
Стремящийся жить может быть пленен.
[Легко] приходящий в ярость и необдуманно [действующий] может быть оскорблен.
Желающий быть добросовестным и чистым может быть опозорен.
Любящий людей может оказаться в затруднении.
Эти пять опасных качеств - крайности для полководца, возможное бедствие при ведении
войны. Уничтожение армии и смерть полководца неизбежно проистекают от этих пяти,
поэтому их нужно изучить."
         
8.Маневрирование армией
Суньцзы сказал:
"Что касается расположения армии и понимания врага:
Пересекая горы, двигайся долинами, ищи надежную позицию и занимай высоты. Если
враг удерживает высоты, не карабкайся вверх, чтобы вступить в бой. Таково расположение
армии в горах.
Перейдя реку, держись на расстоянии от врага. Если он переходит реку, чтобы напасть,
не встречай его в воде. Когда половина его сил переправилась, это удобный момент, чтобы
нанести удар. Если хочешь вступить с врагом в бой, не располагай свои войска около реки,
чтобы встретить его, а ищи удобную позицию и займи высоты. Не становись против течения.
Таков путь расположения армии там, где есть реки.
Когда переходишь через соленые болота или трясину, сделай все возможное, чтобы
побыстрей уйти отсюда, не медли. Если вступишь в битву на болоте, займи травянистое
место, и пусть лес будет сзади. Таков путь расположения армии в болотах и трясинах.
На равнинах располагай силы на удобной местности, справа будут возвышенности,
впереди - опасная местность, сзади - надежная местность. Таково правило расположения на
равнинах.
Эти четыре [расположения], выгодных для армии, обеспечили Хуан-ди победу над
"четырьмя Императорами".
Армия любит высоты и ненавидит низины, ценит солнечное [ян] и презирает темное
[инь]. Она любит жизнь и занимает полноту. Армия, побеждающая сто болезней, одержит
победу.
Там, где холмы и вовзышенности, необходимо занять сторону ян, так, чтобы они были
сзади и справа. Это выгодно для армии и [использует естественную] помощь местности.
Когда в верховьях дожди, река пенится. Если хочешь переправиться, подожди, пока река
успокоится.
Необходимо быстро уходить из опасных мест, таких как отвесные ущелья с горными
проходами, "небесный колодец", "небесная темница", "небесная сеть", "небесная яма" и
"небесная расщелина". Не приближайся к ним. Когда мы держимся от них на расстоянии,
противник [вынужден] иметь их в своем тылу.
Когда армия сталкивается с оврагами и ущельями, заболоченной местностью с
тростником и высокой травой, горными лесами или густым и спутанным кустарником,
необходимо тщательно прочесать их, ибо там могут быть спрятаны засады и шпионы.
Если [враг] невдалеке от нас ведет себя тихо, он опирается на помощь оврагов. Если,
издалека, он вызывает на бой, значит он хочет, чтобы ты наступал, [ибо] занимает выгодную
и удобную ровную местность.
Если зашевелились деревья, враг приближается. Если в густой траве много [заметных]
препятствий, это для того, чтобы вызвать наше подозрение. Если взлетают птицы, там засада.
Если животные испуганы, враг готовит внезапную атаку.
Если пыль поднимается кверху столбом, это значит, что идут колесницы. Если она
стелется низко и широко, это наступает пехота. Если она рассеивается тонкими струйками,
значит собирают хворост. Если она редкая, приближается и удаляется, значит разбивают
лагерь.
Тот, кто говорит почтительно, но усиливает приготовления, будет наступать. Тот, кто
говорит воинственно и продвигается поспешно, отступит.
Тот, чьи легкие колесницы первыми развертываются веером в стороны, готовится [к
битве].
Тот, кто ищет мира, не ставя никаких предварительных условий, [следует] стратагеме.
Тот, чьи войска мечутся, но [кто] располагает свою армию в боевой порядок, выполняет
заранее намеченное.
Тот, [чьи войска] то наступают, то отходят, заманивает.
Те, кто стоят, облокотившись на оружие, голодны. Если те, кто носит воду, пьют
первыми, значит они испытывают жажду. Если они видят ясную выгоду, но не знают,
наступать ли, значит, они устали.
Там, где птицы собираются в стаи, никого нет. Если противник перекликается ночью, он
напуган. Если армия волнуется, значит у полководца недостаточно жестокости. Если знамена
и флаги переходят с места на место, противник в смятении. Если его командиры в ярости,
значит, враг утомлен.
Если они убивают лошадей и едят мясо, значит, в армии мало зерна. Если они
развешивают черпаки и кувшины и не возвращаются в лагерь, это значит, что они готовятся к
отчаянной схватке.
Тот, у кого воины постоянно собираются малыми группами то здесь, то там,
перешептываясь между собой, утратил власть над армией. Тот, кто часто раздает награды,
находится в глубоком затруднении. Кто часто накладывает наказания, находится в сложном
положении. Тот, кто вначале жесток, а потом боится людей, являет собой образец глупости.
Тот, кто направляет посланников с предложениями, хочет передышки.
Если войска противника подняты и приближаются к нашим силам только для того,
чтобы занять позиции и не вступать в битву, за ними нужно внимательно наблюдать.
Для армии многочисленность - не самое главное, ибо в противном случае это означает
невозможность угрожать и нападать. Достаточно оценить собственные силы, оценить
положение врага и захватить его. Только испытывающий недостаток ума и
пренебрежительный к врагу обязательно попадет в плен.
Если накладываешь наказания на войска до того, как стали преданы тебе, они не будут
подчиняться. Если они не подчиняются, их будет трудно использовать. Если не
накладываешь наказания после того, как войска стали преданы тебе, их нельзя использовать.
Поэтому, если командуешь ими с помощью гражданских методов и объединяешь их
военными методами, это называется "уверенно схватить их".
Если приказы постоянно применяются для наставления людей, люди будут
повиноваться. Если приказы применяются для наставления людей не постоянно, люди не
будут повиноваться. Тот, чьи приказы постоянно выполняются, установил взаимопонимание
между людьми."
         
9.Формы местности
Суньцзы сказал:
"Основные формы местности следующие: доступная, висящая, тупиковая, сжатая,
обрывистая и обширная.
Если мы можем идти вперед и противник тоже может продвигаться, это называется
"доступной местностью". На такой местности, первым делом занимай высоты и [строну] ян, а
также обеспечь пути для подвоза провианта. Тогда, если мы вступим в битву, за нами будет
преимущество.
Если мы можем продвигаться вперед, но вернуться будет трудно, это называется
"висящей местностью". В этой ситуации, если противник не подготовлен, или вперед и
побеждай его. Если противник подготовлен, а мы безуспешно предприняли вылазку,
вернуться назад будет трудно и выгоды не будет.
Если ни нам, ни противнику не выгодно идти вперед, это называется "тупиковой
местностью". В этом положении, даже если противник пытается завлечь нас выгодой, мы не
идем вперед. Отведи [наши силы] и отходи. Если мы нанесем удар тогда, когда половина
войск противника продвинулась вперед, это будет выгодно.
Что касается "сжатой" местности, если мы занимаем ее первыми, необходимо занять ее
всю и ждать противника. Если противник занимает ее первым и всю, не следуй за ним. Если
он занимает ее не всю, тогда следуй за ним.
Что касается обрывистой местности, если мы занимаем ее первой, мы должны держать
высоты и сторону ян, чтобы ждать противника. Если противник займет ее первым, отведи
[наши силы] и уходи. Не преследуй противника.
Что касается обширной местности, если наши стратегические силы равны, будет трудно
вызвать [противника] на бой. Вступить в сражение не будет выгодно.
Таковы шесть Дао местности. Любой полководец, облеченный ответственностью
командования, не может не изучать их.
Поэтому, есть [шесть типов злополучных] армий: бегущая, распущенная, тонущая,
разрушающаяся, беспорядочная и разгромленная. Эти шесть не от Неба и Земли, а от ошибок
полководца.
Когда стратегические силы равны, а один нападает на десятерых, это называется
"бегущая".
Если войска сильны, а командиры - слабы, это называется "распущенная".
Если командиры сильны, а войска - слабы, это называется "тонущая".
Если высшие командиры в ярости и не подчиняются, самовольно, не удерживая гнева,
вступают в бой, а полководец не знает их способностей, это называется "разрушающаяся".
Если полководец слаб и недостаточно строг, не устойчив в своих распоряжениях и
руководстве; командиры и войска не выполняют постоянных [обязанностей], а расположение
войск в боевой порядок идет кое-как, это называется "беспорядочная".
Если полководец, неспособный оценить противника, вступает в бой с малыми силами
против многочисленных, нападает со слабыми на сильных, а в армии нет проверенных
отборных частей, это называется "разгромленная".
Таковы шесть Дао поражения. Любой полководец, облеченный ответственностью
командования, не может не изучать их.
Формы местности - это помощь армии. Наблюдение за врагом, организация победы,
изучение оврагов и ущелий, далекого и близкого - все это составляет Дао
главнокомандующего. Тот, кто знает и использует все это в бою, непременно одержит
победу. Тот, кто не знает этого или не использует это в бою, непременно будет разбит.
Если Дао войны определенно [говорит] о победе, то даже если правитель требует
избегать сражения, если сражаешься, это разрешено. Если Дао войны говорит о том, что не
одержишь победу, то даже если правитель требует вступить в сражение, если избегаешь
сражения - это разрешено.
Поэтому [командующий], который не наступает только для того, чтобы снискать славу и
не [воздерживается от сражения] только для того, чтобы [избежать смертного приговора] за
просчеты и отступление, но желает только сохранить людей и принести правителю выгоду -
сокровище для государства.
Когда полководец смотрит на войска, как на своих детей, они пойдут за ним в самые
глубокие долины. Когда он относится к войскам, как к своим любимым детям, они будут
жаждать умереть вместе с ним.
Но с ними хорошо обращаются, но их нельзя использовать, если их любят, но ими
нельзя командовать, или, когда они в смятении, ими нельзя управлять, их можно сравнить с
высокомерными детьми и их нельзя использовать.
Если я знаю, что с нашими войсками можно нападать, но не знаю, что на врага нельзя
нападать, это только полпути к победе. Если знаю, что противника можно атаковать, но не
знаю, что наши войска не могут нападать, это только полпути к победе.
Знать, что на противника можно напасть и знать, что наша армия способна совершить
нападение, но не знать, что местность для сражения неудобная, это только полпути к победе.
Поэтому тот, кто действительно знает армию, никогда не будет введен в заблуждение, когда
он выступает, и никогда не будет доведен до крайности, предпринимая действия.
Поэтому сказано: если знаешь врага и знаешь себя, твоя победа будет несомненна. Если
знаешь Небо и знаешь Землю, твоя победа будет полной."
         
10.Девять местностей
Суньцзы сказал:
"Стратегия ведения войны такова: существуют рассеивающие местности, ненадежные
местности, спорные местности, пересекающиеся местности, узловые местности, трудные
местности, местности-ловушки, окруженные местности и смертельные местности.
Когда удельные князья сражаются на собственной земле, это "рассеивающая местность".
Когда они вступают на чужие земли, но не глубоко, это "ненадежная местность".
Если, когда мы занимаем местность, это выгодно нам, а когда противник - ему, тогда это
- "спорная местность".
Когда мы можем продвинуться и противник тоже может идти навстречу, это -
"пересекающаяся местность".
Земля удельных князей окружена с трех сторон так, что кто бы ни пришел первым,
получит выгоду в Поднебесной; это - "узловая местность".
Когда кто-либо заходит вглубь чужой земли, обходя многочисленные города, это -
"трудная местность".
Где горы и леса, овраги и ущелья, топи и болота, а по дороге трудно держать связь, это -
"местность-ловушка".
Когда вход сжат со всех сторон, а возвращение возможно только окружным путем, и
противник может напасть на нас небольшими силами, это - "окруженная местность".
Когда, самоотверженно сражаясь, выживают, а если не сражаются, то погибают, это -
"смертельная местность".
Поэтому не вступай в сражение на рассеивающей местности.
Не останавливайся на ненадежной местности.
Не атакуй на спорной местности.
На пересекающейся местности не допускай, чтобы войска оказались отрезанными.
На узловой местности объединяйся и заключай союзы [с соседними удельными
князьями].
На тяжелой местности отбирай провизию.
По местности-ловушке проходи [быстро].
На окруженной местности используй стратегию.
На смертельной местности вступай в битву.
В древности те, кто умел вести войну, могли препятствовать тому, чтобы передние
формирования противника и тыл поддерживали связь друг с другом; чтобы крупные и мелкие
части опирались друг на друга; чтобы знатные и низкие приходили друг другу на помощь;
чтобы высшие и низшие чины доверяли друг другу. Они умели способствовать тому, чтобы
войска были разделены и не могли соединиться, а если бы даже соединились, ими нельзя
было управлять. Они выступали, когда было выгодно; когда не выгодно, останавливались.
Если я спрошу: когда противник многочисленный, собранный и собирается наступать,
как мы должны ответить на это? Я скажу, сперва захвати то, что он любит, и тогда он будет
слушать тебя.
В этом природа армии: главное - быстрота; использовать отсутствии противника; идти
неожиданным путем; атаковать там, где он не подготовился.
В целом, Дао наступательной войны состоит в том, чтобы, проникнув глубоко [на
чужую землю], держать силы в единстве, тогда защищающиеся не смогут победить тебя.
Если добывать продовольствие в плодородной местности, у трех армий будет
достаточно пищи. Если внимательно заботиться о них и не перетруждать их, то ци [войска]
соберется воедино, а силы будут наивысшие.
Когда собираешь армию и выстраиваешь замыслы, никто не должен проникнуть в их
тайники.
Бросай их туда, откуда нет выхода, и они будут умирать, не отступая. Когда нет
возможности избегнуть смерти, командиры и солдаты отдадут все свои силы.
Когда командиры и солдаты проникли вглубь [чужой земли], они будут держаться друг
за друга. Когда нет выхода, они будут сражаться.
Поэтому, даже если солдаты не предостережены, они подготовлены; без всяких усилий
они поддерживают друг друга; без всяких сомнений они близки друг другу; без всяких
приказаний на них можно положиться. Запрети предсказания, устрани сомнения, и мысли не
отвлекут их от смерти.
Если у наших воинов нет большого имущества, это не потому, что они презирают
богатство. Если они не живут долго, это не потому, что они ненавидят долголетие. В день,
когда отданы приказания, слезы тех солдат, кто сидит, намочат рукава, а слезы тех, кто
лежит, скатятся по щекам. Однако, если поставить их в безнадежное положение, они проявят
мужество Чжу или Гуя.
Поэтому тот, кто умело ведет войну, подобен змее-шуайчжань. Шуайчжань живет на
горе Чаншань. Если ударить ее по голове, отзовется хвост; если ударить по хвосту, отзовется
голова. Если ударить по середине, отзовется и хвост, и голова. Если спрошу, можем ли мы
сделать армию подобной этой змее, я скажу - можем. Например, люди У и Юэ ненавидят друг
друга; но если они пересекают реку в одной лодке, и вдруг налетел сильный ветер, они будут
помогать друг другу, как левая и правая рука.
Поэтому, недостаточно связать коней и зарыть в землю колесницы по самые оси, [чтобы
предотвратить бегство солдат]. Соежини их мужество, чтобы они стали как одно, с помощью
Дао управления. Осуществи правильное соединение твердого и легкого с помощью формы
местности.
Поэтому тот, кто преуспел в ведении войны, ведет войско за руку, как будто бы это один
человек, так, что оно не может избежать этого.
Для полководца важно быть спокойным и непостижимым для других; прямым и
дисциплинированным, способным притуплять слух и зрение солдат и командиров, держа их в
неведении. Он вносит изменения в управление и замыслы, чтобы люди не узнали о них. Он
скрывает свое положение и идет окольным путем, чтобы другие не могли предвидеть его
действия.
Момент, когда полководец назначен командовать войсками, подобен тому, как если бы
они взобрались на высоту и оставили лестницы. Полководец продвигается вместе с ними
вглубь земель князей и затем спускает крючок. Он командует ими, как будто ведет стадо овец
- вперед, назад, но никто не знает, куда они идут.
Собрать силы трех армий, бросить их в опасность - в этом долг полководца.
Девять изменений местности - преимущества, проистекающие из сжатия и растяжения,
формы человеческих чувств - это все нужно изучить.
В целом, Дао наступательной войны в следующем:
Когда войска зашли далеко, они будут объединены, но где это недалеко, они [будут
склонны] рассеиваться.
Когда [армия] покинула государство, пересекла границу [врага] и ведет войну, это
"отрезанная местность".
Когда четыре стороны открыты, это "узловая местность".
Когда продвинулся далеко, это "тяжелая местность".
Когда продвинулся недалеко, это "ненадежная местность".
Если позади тебя - крепость, а впереди - узкое пространство, это "окруженная
местность".
Если идти некуда, это "смертельная местность".
Поэтому на рассеивающей местности я собираю воедино их волю.
На ненадежной местности я велю им собраться.
На спорной местности я выдвигаю тыловые части вперед.
На пересекающейся местности я уделяю внимание обороне.
На узловой местности я укрепляю наши союзы.
На тяжелой местности я обеспечиваю постоянное снабжение продовольствием.
В местности-ловушке я [быстро] продвигаюсь вдоль дорог.
На окруженной местности я закрываю все проходы.
На смертельной местности я показываю врагу, что мы готовы погибнуть.
Так, природа армии в том, чтобы обороняться, когда она окружена; чтобы яростно
сражаться, когда нет другого выхода; чтобы следовать приказаниям при вынужденных
[обстоятельствах].
Поэтому тот, кто не знает замыслов удельных князей, не может заключать наперед
союзов. Тот, кто не знает расположения гор и лесов, оврагов и ущелий, трясин и болот, не
может управлять армией. Тот, у кого нет местных проводников, не воспользуется
преимуществами местности. Тот, кто не знает одного из этих девяти, не может командовать
армией гегемона или подлинного правителя.
Когда армия гегемона или подлинного правителя нападает на большое государство, оно
не может собрать свои силы. Когда она направляет на врага свою устрашающую силу, его
союзы распадаются. Поэтому она не борется ни с какими союзами в Поднебесной. Она не
укрепляет власть других в Поднебесной. Верь в свои силы, обрати на врага свою
устрашающую силу. Тогда его города могут быть взяты, его государство может быть
подчинено.
Раздавая награды, не требуемые законом, отдавай исключительные приказания.
Управляй силами трех армий, как будто командуешь одним человеком. Давай им задания, не
объясняй им причин. Подчиняй их [будущей] выгодой, но не сообщай о [возможном]
бедствии.
Ставь их в безнадежное положение, и они будут невредимы; веди их вглубь смертельной
местности, и они будут жить. Только когда войска зашли в такую [местность], они смогут
создать победу из поражения.
Ведение военных действий основывается на соответствии и подробном [изучении]
замыслов врага. Если в таком случае кто-либо направляет [свою силу] на противника, наносит
удар на удалении в тысячу ли и убивает полководца, о нем говорят как об "искусном и
умеющем завершать военные дела".
Поэтому в тот день, когда правитель собирает армию, закрой проходы, уничтожь бирки
и не позволяй посланцам врага пройти. Проводи обсуждение стратегии в верхнем зале храма,
чтобы дела были выполнены.
Если враг открывает дверь, следует ворваться.
[Нападай] в первую очередь на то, что он любит. Не утверждай заранее время для
сражения; оценивай и отвечай врагу, дабы определить стратегию битвы.
Поэтому вначале будь как невинная девушка [у себя дома]; затем - когда враг открывает
дверь - будь подобен бегущему зайцу. Противник не сможет противостоять."
         
11.Огневые атаки
Суньцзы сказал:
"Существует пять видов огневых атак: первый, когда сжигают людей; второй, когда
сжигают провиант; третий, когда сжигают обозы; четвертый, когда сжигают арсеналы; пятый,
когда сжигают боевые порядки.
Применение огневых атак зависит от соответствующих условий. Оснащение для
огневых атак нужно полностью приготовить до того, как оно потребуется.
Проведение огневых атак имеет свое благоприятное время года, а разжигание огня -
соответствующие дни. Что касается времен года, то это сухие периоды; что касается дня, то
это когда луна находится в цзи, би, и или чжэнь. Когда луна в этих четырех фазах,
поднимается ветер.
В целом, огневой атаке необходимо отвечать на пять изменений огня:
Если огонь возник в [лагере врага], следует незамедлительно ответить [атакой] извне.
Если огонь пущен, но армия противника спокойна, подожди, не нападай.
Когда пламя достигло вершины, если можешь, последуй за ним; если нет, воздержись.
Если атаку огнем можно начать извне, не полагаясь на [содействие] изнутри, выбери
подходящий момент и начинай.
Если огонь пущен по ветру, не атакуй с подветренной стороны.
Ветер, поднявшийся днем, сохранится; поднявшийся ночью, прекратится.
Армия должна знать пять изменений огня, чтобы противостоять им в благоприятное для
их использования время. Поэтому, помощь огня при нападении очевидна, помощь воды при
ведении атаки также могущественна. Водой можно отрезать, но нельзя захватить.
Поэтому, если кто-либо побеждает в битве и успешно нападает, но не использует этих
средств, это беда, а его самого называют "расточительным и медлительным". Поэтому
сказано, что мудрый полководец обдумывает их; хороший полководец использует их.
Если не выгодно, не выступай. Если цели нельзя достигнуть, не используй армию. До
тех пор, пока не будет угрожать опасность, не вступай в войну. Правитель не может собрать
армию только из-за своего гнева. Полководец не может вступить в битву только из-за
крушения своих надежд. Когда выгодно, продвигайся; когда невыгодно, остановись. Гнев
может вновь обратиться в счастье, раздражение может вновь обратиться в радость, но
уничтоженное государство невозможно оживить; мертвого нельзя вернуть к жизни.
Поэтому просвещенный правитель осторожен с войной, хороший полководец
почтителен к ней. В этом Дао обеспечения безопасности государства и сохранения армии в
целости."
         
12.Использование шпионов
Суньцзы сказал:
"Когда посылают в поход армию в сто тысяч на расстояние в тысячу ли, затраты народа
и расходы правящего дома будут составлять тысячу золотых в день. Тех, кому причинят
беспокойство и ущерб внутри и вовне, кто будет истощен от дороги и не сможет заниматься
сельскохозяйственным трудом, будет семьсот тысяч семей.
Армии находятся в отдалении на протяжении нескольких лет, чтобы в течении одного
дня сражаться за победу, если [полководцы] скупятся на ранги и вознаграждения в сто
золотых и, поэтому, не знают положения врага. Это предел негуманности. Такой человек - не
полководец над людьми, не помощник правителю, не вершитель победы.
Средством, благодаря которому просвещенные правители и мудрые полководцы
выступали и покоряли других, а их достижения превосходили многих, было упреждающее
знание.
Упреждающее знание нельзя получить от демонов и духов, нельзя получить из явлений
или небесных знамений; оно должно быть получено от людей, ибо есть знание подлинного
положения противника.
Поэтому существует пять видов использования шпионов: местные шпионы, внутренние
шпионы, обращенные [двойные] шпионы, мертвые [невозвратимые] шпионы и возвратимые
шпионы. Когда использованы все пять видов и никто не знает их пути, это называется
"таинственным методом". Они - сокровище для правителя.
Местные шпионы - используй людей, проживающих в соответствующих областях.
Внутренние шпионы - используй людей, которые занимают пост в государстве врага.
Двойные агенты - используй шпионов противника.
Невозвратимые шпионы - используются для распространения дезинформации вне
государства. Снабди наших [невозвратимых] шпионов [ложными сведениями] и пусть они
передадут их агентам врага.
Возвратимые шпионы - возвращаются с информацией.
Поэтому из всех дел в трех армиях нет более близких, чем со шпионами; нет наград
более щедрых, чем даваемые шпионам; нет дел более секретных, чем касающиеся шпионов.
Не обладая мудростью совершенномудрого, нельзя использовать шпионов; не будучи
гуманным и справедливым, нельзя задействовать шпионов; не будучи непостижимым и
вдумчивым, невозможно уловить суть разведывательных донесений. Это непостижимо,
непостижимо! Нет мест, где бы не использовали шпионов.
Если еще до начала миссии она была раскрыта, шпион и те, кому он передал сведения,
должны быть казнены.
В целом, что касается армий, по которым хочешь нанести удар, городов, на которые
хочешь напасть, людей, которых хочешь уничтожить, первым делом узнай имена
командующего обороной, его помощников, членов штаба, личной охраны и слуг. Пусть наши
шпионы все узнают.
Необходимо искать шпионов врага, которые пришли шпионить против нас. Соблазни их
выгодой, возьми к себе и удержи их. Так можно приобрести и использовать двойных агентов.
Благодаря полученным от них сведениям, можно присвоить местных и внутренних шпионов.
благодаря полученным от них сведениям, невозвратимые шпионы могут распространить
заблуждения, тем самым обманывая врага. Благодаря полученным от них сведениям, можешь
использовать возвращающихся шпионов, когда потребуется.
Правитель должен знать эти пять правил работы со шпионами. Это знание зависит от
обращенных шпионов: поэтому, необходимо быть щедрым по отношению к двойным
агентам.
В древности, когда поднималось царство Инь, у них был И Чжи в государстве Ся. Когда
поднималось Чжоу, у них был Люй Я [Тай-гун] в Инь. Поэтому просвещенные государи и
мудрые полководцы, которые способны заполучить умных шпионов, обязательно достигнут
великих результатов. В этом - сокровенный путь военных действий, то, на что, выступая,
полагаются три армии."
""")

for i in range(len(a)):
    if a[i]=='"':
        a[i] = "'"

for i in range(1, len(a)+1):
    f.write(f'{"e"*i} = """{a[i-1]}"""\n')

f.write("book = ''")

f.write(f"""
for i in range(1, {len(a)+1}):
    book += locals()['e'*i]

""")

f.write(f"print(book)")

